ams/src/Documents/AMS_ЛогистическийЛист/AMS_ЛогистическийЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ЛогистическийЛист</name>
  <registerRecords>InformationRegister._Рейсы</registerRecords>
  <registerRecords>InformationRegister._РейсыРаспоряжения</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаВодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПропуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАгента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗагрузкиФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВМаршруте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъединеннаяЗагрузка</name>
      <type>
        <types>DocumentRef.AMS_ОбъединеннаяЗагрузка</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.AMS_ПередачаВПереработку</types>
        <types>DocumentRef.ОтгрузкаТоваровКлиенту</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАдресаДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЧек</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНарушениеДоговора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьПретензия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подвоз</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтменыДоставки</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>EnumRef._ПричиныОтменыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратыТоваров</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>EnumRef._ПричиныОтменыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияЗаказа</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подвоз</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Documents/AMS_ЛогистическийЛист/Forms/ФормаОтменаДоставки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ВыполнитьДействие", ВыполнитьДействие);
	Параметры.Свойство("ТранспортноеСредство", ТранспортноеСредство);
	Параметры.Свойство("Водитель", Водитель);
	Параметры.Свойство("СтоимостьДоставки", СтоимостьДоставки);

	Организация = Неопределено;
	Параметры.Свойство("Организация", Организация);

	Распоряжение = Неопределено;
	Параметры.Свойство("Распоряжение", Распоряжение);

	МассивРаспоряжений = Неопределено;
	Параметры.Свойство("МассивРаспоряжений", МассивРаспоряжений);

	Если ВыполнитьДействие = "Отменить доставку" Тогда
		Заголовок                                    = "Отмена доставки";
		Элементы.ФормаОтменитьДоставку.Заголовок     = "Отменить доставку";
		Элементы.РаспоряженияГруппаДоплата.Видимость = Ложь;
		НомерСтроки                                  = 0;

		Для Каждого Распоряжение Из МассивРаспоряжений Цикл
			НомерСтроки = НомерСтроки + 1;

			СтрДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Распоряжение, "Партнер,AMS_КоличествоПалет,AMS_Вес");

			НовСтр = Распоряжения.Добавить();

			НовСтр.НомерСтроки     = НомерСтроки;
			НовСтр.Распоряжение    = Распоряжение;
			НовСтр.Партнер         = СтрДок.Партнер;
			НовСтр.КоличествоПалет = СтрДок.AMS_КоличествоПалет;
			НовСтр.Вес             = СтрДок.AMS_Вес;
		КонецЦикла;

	ИначеЕсли ВыполнитьДействие = "Возврат товара" Тогда
		Заголовок                                = "Возврат товара";
		Элементы.ФормаОтменитьДоставку.Заголовок = "Выполнить";
		Вес                                      = 0;
		НомерСтроки                              = 0;

		Массив = Новый Массив;
		Для Каждого Стр Из МассивРаспоряжений Цикл
			Массив.Добавить(Стр.Распоряжение);
		КонецЦикла;
		
		//@skip-check bsl-legacy-check-string-literal
		СоотДокВес = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Массив, "AMS_Вес");

		Для Каждого КлючЗначение Из СоотДокВес Цикл
			Вес = Вес + КлючЗначение.Значение;
		КонецЦикла;

		Для Каждого Стр Из МассивРаспоряжений Цикл
			НомерСтроки = НомерСтроки + 1;

			НовСтр = Распоряжения.Добавить();

			ЗаполнитьЗначенияСвойств(НовСтр, Стр);

			НовСтр.НомерСтроки  = НомерСтроки;
			НовСтр.Организация  = Организация;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПричинаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьДоставку(Команда)
	Если Не ЗначениеЗаполнено(Причина) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле ""Причина отмены доставки"".");
		Возврат;
	КонецЕсли;

	Модифицированность = Ложь; //Снятие модифицированности, т.к. перед закрытием признак проверяется

	Закрыть(ПолучитьДанныеДляОтменыДоставки());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеДляОтменыДоставки()
	Результат = Новый Структура;

	Если ВыполнитьДействие = "Отменить доставку" Тогда
		МассивРаспоряжений = Новый Массив;

		Для Каждого Стр Из Распоряжения Цикл
			СтрДок = Новый Структура;

			Док = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.Распоряжение, "Номер, Дата");

			СтрДок.Вставить("ПредставлениеРаспоряжения", ОбщегоНазначенияУТ.ПолучитьПредставлениеДокумента(
				Стр.Распоряжение, Док.Номер, Док.Дата));
			СтрДок.Вставить("Распоряжение", Стр.Распоряжение);
			СтрДок.Вставить("Партнер", Стр.Партнер);
			СтрДок.Вставить("Вес", Стр.Вес);
			СтрДок.Вставить("КоличествоПалет", Стр.КоличествоПалет);

			МассивРаспоряжений.Добавить(СтрДок);
		КонецЦикла;

		Результат.Вставить("ТранспортноеСредство", ТранспортноеСредство);
		Результат.Вставить("Водитель", Водитель);
		Результат.Вставить("ДатаОтменыДоставки", ТекущаяДатаСеанса());
		Результат.Вставить("Причина", Причина);
		Результат.Вставить("МассивРаспоряжений", МассивРаспоряжений);

	ИначеЕсли ВыполнитьДействие = "Возврат товара" Тогда
		МассивРаспоряжений = Новый Массив;

		Для Каждого Стр Из Распоряжения Цикл
			СтрДок = Новый Структура;

			Док = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.Распоряжение, "Номер, Дата");

			Если ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				Или ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.AMS_ПередачаВПереработку") Тогда
				Подвоз = Ложь;
				
			ИначеЕсли ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику")
				Или ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
				Подвоз = Истина;
			КонецЕсли;

			СтрДок.Вставить("ПредставлениеРаспоряжения", ОбщегоНазначенияУТ.ПолучитьПредставлениеДокумента(
				Стр.Распоряжение, Док.Номер, Док.Дата));
			СтрДок.Вставить("Подвоз", Подвоз);
			СтрДок.Вставить("Распоряжение", Стр.Распоряжение);
			СтрДок.Вставить("Партнер", Стр.Партнер);
			СтрДок.Вставить("Организация", Стр.Организация);
			СтрДок.Вставить("ОрганизацияЗаказа", Стр.ОрганизацияЗаказа);
			СтрДок.Вставить("СуммаДокумента", Стр.СуммаДокумента);
			СтрДок.Вставить("СтоимостьЧека", Стр.СтоимостьЧека);
			СтрДок.Вставить("ПунктДоговора", Стр.ПунктДоговора);
			СтрДок.Вставить("СуммаШтрафа", Стр.СуммаШтрафа);
			СтрДок.Вставить("СодержаниеПретензии", Стр.СодержаниеПретензии);
			СтрДок.Вставить("СуммаПретензии", Стр.СуммаПретензии);
			СтрДок.Вставить("Вес", Стр.Вес);
			СтрДок.Вставить("КоличествоПалет", Стр.КоличествоПалет);

			МассивРаспоряжений.Добавить(СтрДок);
		КонецЦикла;

		Результат.Вставить("ТранспортноеСредство", ТранспортноеСредство);
		Результат.Вставить("Водитель", Водитель);
		Результат.Вставить("ДатаОтменыДоставки", ТекущаяДатаСеанса());
		Результат.Вставить("Причина", Причина);
		Результат.Вставить("МассивРаспоряжений", МассивРаспоряжений);
	КонецЕсли;

	Возврат Результат;
КонецФункции

#КонецОбласти
